//PCPARSER PROC PRINT='A',INDS=
//*
//* PROCESS PSEUDOCODE
//*
//* PARAMETERS
//*      PRINT     - OUTPUT CLASS FOR PRINT OUTPUT
//*      INDS      - PSEUDOCODE INPUT
//*
//* DDNAMES
//*      OUTDS     - OUTPUT DATASET FOR FORMATTED PSEUDOCODE
//*      OUTGEN    - OUTPUT DATASET FOR CODE FRAMES
//*
//PCPARSER EXEC PGM=PCPARSER,PARM='R=256K'
//INDS     DD   DISP=SHR,DSN=&INDS
//OUTPRNT  DD   SYSOUT=&PRINT,DCB=(BLKSIZE=6233,LRECL=137,RECFM=VBA)
//* ANY OTHER BLKSIZE > 141 FOR OUTPRNT IS WELLCOME
//STEPLIB  DD   DISP=SHR,DSN=SYS2.SPTS.LINKLIB
//SYSIN    DD   DUMMY
//SYSPRINT DD   SYSOUT=&PRINT
//SYSPUNCH DD   DUMMY
//*OUTDS   DD   AUSGABEDATEI FUER FORMATIERTEN PSEUDO-CODE
//*OUTGEN  DD   AUSGABEDATEI FUER GENERIERTES CODE-GERUEST
