//&SYSIDM JOB ,'S MACLIBVERS3.04',TIME=(,30),NOTIFY=&SYSID,MSGCLASS=A,
//             MSGLEVEL=(2,0),PASSWORD=&SYSPSWD
//AIW      OUTPUT GROUPID=BOXC096
//TEXTER EXEC BITSSIM
//PRINT DD DISP=OLD,DSN=SYS2.SPTS.INFO(MACLIB)
?TEXTER;
|OUT=I
|TRTAB=UV
|DICT=D3
|READ=SYS2.SPTS.INFO.TEXTER(CTL)
??E=4;
//*
//TEXTER EXEC BITSSIM,PRINT='(A,,3253),DEST=LOCAL'
//*EXTER EXEC BITSSIM,PRINT='(E,,53),DEST=BIR,COPIES=3'
?TEXTER;
|OUT=I
|TRTAB=UV
|DICT=D3
|READ=SYS2.SPTS.INFO.TEXTER(CTL)
??E=4;
