//CASMXG   PROC LIN=,LIB='SYS1.LINKLIB',
//             TERM='*',PRINT=A
//*
//* EXECUTE PROGRAM
//*    STEPS:
//*       GO        - EXECUTE OBJECT PROGRAM
//*
//* PARAMETERS:
//*       LIN       - OBJECT DECK
//*       TERM      - SYSOUT PARAMETER FOR CONTROL OUTPUT
//*       PRINT     - SYSOUT PARAMETER FOR LISTING
//*       LIB       - LOADLIB FOR EXECUTION
//*
//GO       EXEC PGM=LOADER,PARM=(MAP,PRINT,LET)
//SYSLIB   DD   DISP=SHR,DSN=&LIB
//SYSLIN   DD   DSN=&LIN,DISP=SHR
//SYSLOUT  DD   SYSOUT=&PRINT
//SYSOUT   DD   SYSOUT=&PRINT
//SYSTERM  DD   SYSOUT=&TERM
//SYSPRINT DD   SYSOUT=&PRINT
